# import face_recognition


# image1 = face_recognition.load_image_file(r"A:\Python\MY_projects\opencv\THE  PROJECT\\next 3\\accounts\hosein.jpg")
# face_encoding1 = face_recognition.face_encodings(image1)

# face = "[-0.11280267  0.14145838  0.08018201 -0.00721943 -0.08341715 -0.00737467 -0.09255081 -0.04201489  0.09721249 -0.13722058  0.16613708 -0.02358679 -0.17738828  0.01263383 -0.03514534  0.11443079 -0.17246965 -0.13363405 -0.0925321  -0.03192507  0.07265631  0.02960062 -0.03145688  0.01934741 -0.19897103 -0.24933299 -0.05345555 -0.07910147  0.01468277 -0.09238974 -0.05970011  0.01262081 -0.15833288 -0.06216215  0.03326654  0.1053894 -0.02119614 -0.01827122  0.16326623  0.01349117 -0.17167389  0.12390915 0.06033196  0.2787444   0.18255034  0.10085205  0.00929125 -0.14951234 0.08070201 -0.17552033  0.042058    0.15431055  0.09536897  0.14445816 0.03090554 -0.17823237  0.08216581  0.04323204 -0.12752257  0.07048375 0.05332949 -0.04839368  0.09205095 -0.01311017  0.20425592  0.00649036 -0.06580383 -0.12497421  0.087662   -0.16056764 -0.08251055  0.08487719 -0.08776714 -0.1809506  -0.21913323  0.05154318  0.43696192  0.20777005 -0.18442993  0.06639418 -0.03339871 -0.13276626  0.09905048  0.13597932 -0.08972022  0.00206419 -0.02703499  0.06467727  0.28189299 -0.00202206 -0.02021896  0.18191066  0.07794417  0.01044347  0.06714465 -0.05016447 -0.11726888  0.02748273 -0.11316042 -0.05819146 -0.01228336 -0.1074791 -0.00496402  0.09835649 -0.1691      0.14804649 -0.00900794 -0.05294512 -0.03781606  0.11865336 -0.12300778 -0.05224946  0.16455656 -0.21500643 0.19078164  0.22787738  0.09813271  0.12530968  0.15702257  0.10907631 0.03880517  0.08882717 -0.11018606 -0.06510164  0.08780763 -0.02491565 0.16878702  0.03476463]"

# print(type(face_encoding1))
# print(face_encoding1)
# print(type(face))


# if face == face_encoding1:
#     print("yes")
# else: 
#     print("no")
    
    
    
    
# import json


# # مسیر فایل جیسون
# json_file_path = r"A:\Python\MY_projects\opencv\THE  PROJECT\\next 3\\info.json"

# # باز کردن فایل جیسون و تبدیل به دیکشنری
# with open(json_file_path, "r") as json_file:
#     data = json.load(json_file)

# # یافتن عدد در آخرین براکت
# last_id = data["accounts"][-1]["id"]

# # افزودن یک به عدد یافته
# result = last_id + 1

# print(f"نتیجه: {result}")
    
    
    
    
    
    
    
    
    
    
    
    
    
    
# {
#    "accounts": [
#       {
#          "id": 1
#       }
#    ]
# }
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
# # رشته‌ی داده‌شده
# my_string = "[-0.07918206, 0.11051077, ...]"

# # حذف کاراکترهای اول و آخر
# my_string = my_string[1:-1]

# # تبدیل رشته به لیست
# my_list = my_string.split(", ")

# # چاپ لیست
# print(my_list)

# رشته‌ی داده‌شده
my_string = "[-0.07918206, 0.11051077, ...]"

# تبدیل رشته به لیست اعداد اعشاری
my_list = eval(my_string)

# چاپ لیست
print(my_list)

